DataProcessors/УдалениеКурсовВалютКромеПредопределенных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>УдалениеКурсовВалютКромеПредопределенных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/УстановкаКурсаВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УстановкаКурсаВалют</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.курсыВалют</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/УдалениеКурсовВалютКромеПредопределенных/Forms/Форма/Ext/Form/Module.bsl
Функция ПроверкаСправочника(Справочник)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	НЕ Валюты.Предопределенный
		|	И Валюты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Справочник);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Истина;
	КонецЕсли;
	
    Возврат Ложь;
КонецФункции	
&НаСервере
Процедура УдалитьВалютуНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	НЕ Валюты.Предопределенный
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВалюту(Команда)
	УдалитьВалютуНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалятьКурсыВалютНаСервере()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаКурсаВалютКурсы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УстановкаКурсаВалют.Курсы КАК УстановкаКурсаВалютКурсы
		|ГДЕ
		|	НЕ УстановкаКурсаВалютКурсы.Валюта.Предопределенный ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
	

КонецПроцедуры

&НаКлиенте
Процедура УдалятьКурсыВалют(Команда)
	УдалятьКурсыВалютНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалятьВалютуИзДокументаНаСервере()
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаКурсаВалютКурсы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УстановкаКурсаВалют.Курсы КАК УстановкаКурсаВалютКурсы
		|ГДЕ
		|	НЕ УстановкаКурсаВалютКурсы.Валюта.Предопределенный
		|
		|УПОРЯДОЧИТЬ ПО
		|	УстановкаКурсаВалютКурсы.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Док = Выборка.Ссылка.ПолучитьОбъект();
		КоличествоСтрок = Док.Курсы.Количество();
		Для Счетчик = 0 по КоличествоСтрок - 1 Цикл
			ТекущаяСтрока = Док.Курсы[КоличествоСтрок - Счетчик - 1];
			НЕ_Предопределенный = ПроверкаСправочника(ТекущаяСтрока.Валюта);
				Если НЕ_Предопределенный Тогда
					 Док.Курсы.Удалить(ТекущаяСтрока);
				КонецЕсли;	
		КонецЦикла;	
		
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура УдалятьВалютуИзДокумента(Команда)
	УдалятьВалютуИзДокументаНаСервере();
КонецПроцедуры
